apache/nuttx/arch/arm/src/sam34/chip/sam_tc.h
/************************************************************************************************
 * arch/arm/src/sam34/chip/sam_tc.h
 * Timer Counter (TC) definitions for the SAM3U, SAM4E, and SAM4S
 *
 *   Copyright (C) 2009, 2013-2014 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************************/

#ifndef __ARCH_ARM_SRC_SAM34_CHIP_SAM_TC_H
#define __ARCH_ARM_SRC_SAM34_CHIP_SAM_TC_H

/************************************************************************************************
 * Included Files
 ************************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "chip/sam_memorymap.h"

/************************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************************/

/* TC register offsets **************************************************************************/

/* Timer channel offsets (with respect to timer base offset at 0x00, 0x40, and 0x80 */

#define SAM_TC_CCR_OFFSET            0x0000 /* Channel Control Register */
#define SAM_TC_CMR_OFFSET            0x0004 /* Channel Mode Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC_SMMR_OFFSET         0x0008 /* Stepper Motor Mode Register */
#endif

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC_RAB_OFFSET          0x000c /* Register AB */
#endif
                                            /* 0x0c Reserved */
#define SAM_TC_CV_OFFSET             0x0010 /* Counter Value */
#define SAM_TC_RA_OFFSET             0x0014 /* Register A */
#define SAM_TC_RB_OFFSET             0x0018 /* Register B */
#define SAM_TC_RC_OFFSET             0x001c /* Register C */
#define SAM_TC_SR_OFFSET             0x0020 /* Status Register */
#define SAM_TC_IER_OFFSET            0x0024 /* Interrupt Enable Register */
#define SAM_TC_IDR_OFFSET            0x0028 /* Interrupt Disable Register */
#define SAM_TC_IMR_OFFSET            0x002c /* Interrupt Mask Register */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC_EMR_OFFSET          0x0030 /* Extended Mode Register */
#endif

/* Timer common registers */

#define SAM_TC_BCR_OFFSET            0x00c0 /* Block Control Register */
#define SAM_TC_BMR_OFFSET            0x00c4 /* Block Mode Register */
#define SAM_TC_QIER_OFFSET           0x00c8 /* QDEC Interrupt Enable Register */
#define SAM_TC_QIDR_OFFSET           0x00cc /* QDEC Interrupt Disable Register */
#define SAM_TC_QIMR_OFFSET           0x00d0 /* QDEC Interrupt Mask Register */
#define SAM_TC_QISR_OFFSET           0x00d4 /* QDEC Interrupt Status Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC_FMR_OFFSET          0xd8 /* Fault Mode Register */
#  define SAM_TC_WPMR_OFFSET         0xe4 /* Write Protect Mode Register */
#endif

/* TC register addresses ************************************************************************/

#define SAM_TC0_CCR                  (SAM_TC0_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC0_CMR                  (SAM_TC0_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC0_SMMR               (SAM_TC0_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC0_RAB                (SAM_TC0_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC0_CV                   (SAM_TC0_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC0_RA                   (SAM_TC0_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC0_RB                   (SAM_TC0_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC0_RC                   (SAM_TC0_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC0_SR                   (SAM_TC0_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC0_IER                  (SAM_TC0_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC0_IDR                  (SAM_TC0_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC0_IMR                  (SAM_TC0_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC0_EMR                (SAM_TC0_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC1_CCR                  (SAM_TC1_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC1_CMR                  (SAM_TC1_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC1_SMMR               (SAM_TC1_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC1_RAB                (SAM_TC1_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC1_CV                   (SAM_TC1_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC1_RA                   (SAM_TC1_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC1_RB                   (SAM_TC1_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC1_RC                   (SAM_TC1_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC1_SR                   (SAM_TC1_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC1_IER                  (SAM_TC1_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC1_IDR                  (SAM_TC1_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC1_IMR                  (SAM_TC1_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC1_EMR                (SAM_TC1_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC2_CCR                  (SAM_TC2_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC2_CMR                  (SAM_TC2_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC2_SMMR               (SAM_TC2_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC2_RAB                (SAM_TC2_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC2_CV                   (SAM_TC2_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC2_RA                   (SAM_TC2_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC2_RB                   (SAM_TC2_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC2_RC                   (SAM_TC2_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC2_SR                   (SAM_TC2_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC2_IER                  (SAM_TC2_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC2_IDR                  (SAM_TC2_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC2_IMR                  (SAM_TC2_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC2_EMR                (SAM_TC2_BASE+SAM_TC_EMR_OFFSET)
#endif

