apache/nuttx/arch/arm/src/sam34/chip/sam_tc.h
#define SAM_TC3_CCR                  (SAM_TC3_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC3_CMR                  (SAM_TC3_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC3_SMMR               (SAM_TC3_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC3_RAB                (SAM_TC3_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC3_CV                   (SAM_TC3_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC3_RA                   (SAM_TC3_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC3_RB                   (SAM_TC3_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC3_RC                   (SAM_TC3_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC3_SR                   (SAM_TC3_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC3_IER                  (SAM_TC3_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC3_IDR                  (SAM_TC3_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC3_IMR                  (SAM_TC3_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC3_EMR                (SAM_TC3_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC4_CCR                  (SAM_TC4_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC4_CMR                  (SAM_TC4_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC4_SMMR               (SAM_TC4_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC4_RAB                (SAM_TC4_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC4_CV                   (SAM_TC4_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC4_RA                   (SAM_TC4_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC4_RB                   (SAM_TC4_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC4_RC                   (SAM_TC4_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC4_SR                   (SAM_TC4_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC4_IER                  (SAM_TC4_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC4_IDR                  (SAM_TC4_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC4_IMR                  (SAM_TC4_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC4_EMR                (SAM_TC4_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC5_CCR                  (SAM_TC5_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC5_CMR                  (SAM_TC5_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC5_SMMR               (SAM_TC5_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC5_RAB                (SAM_TC5_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC5_CV                   (SAM_TC5_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC5_RA                   (SAM_TC5_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC5_RB                   (SAM_TC5_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC5_RC                   (SAM_TC5_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC5_SR                   (SAM_TC5_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC5_IER                  (SAM_TC5_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC5_IDR                  (SAM_TC5_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC5_IMR                  (SAM_TC5_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC5_EMR                (SAM_TC5_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC6_CCR                  (SAM_TC6_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC6_CMR                  (SAM_TC6_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC6_SMMR               (SAM_TC6_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC6_RAB                (SAM_TC6_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC6_CV                   (SAM_TC6_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC6_RA                   (SAM_TC6_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC6_RB                   (SAM_TC6_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC6_RC                   (SAM_TC6_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC6_SR                   (SAM_TC6_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC6_IER                  (SAM_TC6_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC6_IDR                  (SAM_TC6_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC6_IMR                  (SAM_TC6_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC6_EMR                (SAM_TC6_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC7_CCR                  (SAM_TC7_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC7_CMR                  (SAM_TC7_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC7_SMMR               (SAM_TC7_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC7_RAB                (SAM_TC7_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC7_CV                   (SAM_TC7_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC7_RA                   (SAM_TC7_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC7_RB                   (SAM_TC7_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC7_RC                   (SAM_TC7_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC7_SR                   (SAM_TC7_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC7_IER                  (SAM_TC7_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC7_IDR                  (SAM_TC7_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC7_IMR                  (SAM_TC7_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC7_EMR                (SAM_TC7_BASE+SAM_TC_EMR_OFFSET)
#endif

#define SAM_TC8_CCR                  (SAM_TC8_BASE+SAM_TC_CCR_OFFSET)
#define SAM_TC8_CMR                  (SAM_TC8_BASE+SAM_TC_CMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC8_SMMR               (SAM_TC8_BASE+SAM_TC_SMMR_OFFSET)
#endif
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC8_RAB                (SAM_TC8_BASE+SAM_TC_RAB_OFFSET)
#endif
#define SAM_TC8_CV                   (SAM_TC8_BASE+SAM_TC_CV_OFFSET)
#define SAM_TC8_RA                   (SAM_TC8_BASE+SAM_TC_RA_OFFSET)
#define SAM_TC8_RB                   (SAM_TC8_BASE+SAM_TC_RB_OFFSET)
#define SAM_TC8_RC                   (SAM_TC8_BASE+SAM_TC_RC_OFFSET)
#define SAM_TC8_SR                   (SAM_TC8_BASE+SAM_TC_SR_OFFSET)
#define SAM_TC8_IER                  (SAM_TC8_BASE+SAM_TC_IER_OFFSET)
#define SAM_TC8_IDR                  (SAM_TC8_BASE+SAM_TC_IDR_OFFSET)
#define SAM_TC8_IMR                  (SAM_TC8_BASE+SAM_TC_IMR_OFFSET)
#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC8_EMR                (SAM_TC8_BASE+SAM_TC_EMR_OFFSET)
#endif

/* Timer common registers */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define SAM_TC0_BCR                (SAM_TC012_BASE+SAM_TC_BCR_OFFSET)
#  define SAM_TC0_BMR                (SAM_TC012_BASE+SAM_TC_BMR_OFFSET)
#  define SAM_TC0_QIER               (SAM_TC012_BASE+SAM_TC_QIER_OFFSET)
#  define SAM_TC0_QIDR               (SAM_TC012_BASE+SAM_TC_QIDR_OFFSET)
#  define SAM_TC0_QIMR               (SAM_TC012_BASE+SAM_TC_QIMR_OFFSET)
#  define SAM_TC0_QISR               (SAM_TC012_BASE+SAM_TC_QISR_OFFSET)
#  define SAM_TC0_FMR                (SAM_TC012_BASE+SAM_TC_FMR_OFFSET)
#  define SAM_TC0_WPMR               (SAM_TC012_BASE+SAM_TC_WPMR_OFFSET)

#  define SAM_TC1_BCR                (SAM_TC345_BASE+SAM_TC_BCR_OFFSET)
#  define SAM_TC1_BMR                (SAM_TC345_BASE+SAM_TC_BMR_OFFSET)
#  define SAM_TC1_QIER               (SAM_TC345_BASE+SAM_TC_QIER_OFFSET)
#  define SAM_TC1_QIDR               (SAM_TC345_BASE+SAM_TC_QIDR_OFFSET)
#  define SAM_TC1_QIMR               (SAM_TC345_BASE+SAM_TC_QIMR_OFFSET)
#  define SAM_TC1_QISR               (SAM_TC345_BASE+SAM_TC_QISR_OFFSET)
#  define SAM_TC1_FMR                (SAM_TC345_BASE+SAM_TC_FMR_OFFSET)
#  define SAM_TC1_WPMR               (SAM_TC345_BASE+SAM_TC_WPMR_OFFSET)

