apache/nuttx/arch/arm/src/sam34/chip/sam_tc.h
#  define SAM_TC2_BCR                (SAM_TC678_BASE+SAM_TC_BCR_OFFSET)
#  define SAM_TC2_BMR                (SAM_TC678_BASE+SAM_TC_BMR_OFFSET)
#  define SAM_TC2_QIER               (SAM_TC678_BASE+SAM_TC_QIER_OFFSET)
#  define SAM_TC2_QIDR               (SAM_TC678_BASE+SAM_TC_QIDR_OFFSET)
#  define SAM_TC2_QIMR               (SAM_TC678_BASE+SAM_TC_QIMR_OFFSET)
#  define SAM_TC2_QISR               (SAM_TC678_BASE+SAM_TC_QISR_OFFSET)
#  define SAM_TC2_FMR                (SAM_TC678_BASE+SAM_TC_FMR_OFFSET)
#  define SAM_TC2_WPMR               (SAM_TC678_BASE+SAM_TC_WPMR_OFFSET)
#else
#  define SAM_TC_BCR                 (SAM_TC_BASE+SAM_TC_BCR_OFFSET)
#  define SAM_TC_BMR                 (SAM_TC_BASE+SAM_TC_BMR_OFFSET)
#  define SAM_TC_QIER                (SAM_TC_BASE+SAM_TC_QIER_OFFSET)
#  define SAM_TC_QIDR                (SAM_TC_BASE+SAM_TC_QIDR_OFFSET)
#  define SAM_TC_QIMR                (SAM_TC_BASE+SAM_TC_QIMR_OFFSET)
#  define SAM_TC_QISR                (SAM_TC_BASE+SAM_TC_QISR_OFFSET)
#endif

/* TC register bit definitions ******************************************************************/
/* Timer channel registers **********************************************************************/

/* TC Channel Control Register */

#define TC_CCR_CLKEN                 (1 << 0)  /* Bit 0: Counter Clock Enable Command */
#define TC_CCR_CLKDIS                (1 << 1)  /* Bit 1: Counter Clock Disable Command */
#define TC_CCR_SWTRG                 (1 << 2)  /* Bit 2: Software Trigger Command */

/* TC Channel Mode Register -- Common */

#define TC_CMR_TCCLKS_SHIFT          (0)       /* Bits 0-2: Clock Selection */
#define TC_CMR_TCCLKS_MASK           (7 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_TIMERCLOCK1  (0 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_TIMERCLOCK2  (1 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_TIMERCLOCK3  (2 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_TIMERCLOCK4  (3 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_TIMERCLOCK5  (4 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_XC0          (5 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_XC1          (6 << TC_CMR_TCCLKS_SHIFT)
#  define TC_CMR_TCCLKS_XC2          (7 << TC_CMR_TCCLKS_SHIFT)
#define TC_CMR_CLKI                  (1 << 3)  /* Bit 3: Clock Invert */
#define TC_CMR_BURST_SHIFT           (4)       /* Bits 4-5: Burst Signal Selection */
#define TC_CMR_BURST_MASK            (3 << TC_CMR_BURST_MASK)
#  define TC_CMR_BURST_NOTGATED      (0 << TC_CMR_BURST_MASK) /* Nott gated by external signal */
#  define TC_CMR_BURST_XC0           (1 << TC_CMR_BURST_MASK) /* XC0 ANDed with selected clock */
#  define TC_CMR_BURST_XC1           (2 << TC_CMR_BURST_MASK) /* XC1 ANDed with selected clock */
#  define TC_CMR_BURST_XC2           (3 << TC_CMR_BURST_MASK) /* XC2 ANDed with selected clock */
#define TC_CMR_WAVE                  (1 << 15) /* Bit 15: Waveform Mode */

/* TC Channel Mode Register -- Capture mode only */

#define TC_CMR_LDBSTOP               (1 << 6)  /* Bit 6: Counter stopped with RB Loading */
#define TC_CMR_LDBDIS                (1 << 7)  /* Bit 7: Counter disable with RB Loading */
#define TC_CMR_ETRGEDG_SHIFT         (8)       /* Bits 8-9: External Trigger Edge Selection */
#define TC_CMR_ETRGEDG_MASK          (3 << TC_CMR_ETRGEDG_SHIFT)
#  define TC_CMR_ETRGEDG_NONE        (0 << TC_CMR_ETRGEDG_SHIFT) /* None */
#  define TC_CMR_ETRGEDG_REDGE       (1 << TC_CMR_ETRGEDG_SHIFT) /* Rising edge */
#  define TC_CMR_ETRGEDG_FEDGE       (2 << TC_CMR_ETRGEDG_SHIFT) /* Falling edge */
#  define TC_CMR_ETRGEDG_EACH        (3 << TC_CMR_ETRGEDG_SHIFT) /* Each */
#define TC_CMR_ABETRG                (1 << 10) /* Bit 10: TIOA or TIOB External Trigger Selection */
#define TC_CMR_CPCTRG                (1 << 14) /* Bit 14: RC Compare Trigger Enable */
#define TC_CMR_LDRA_SHIFT            (16)      /* Bits 16-17: RA Loading Selection */
#define TC_CMR_LDRA_MASK             (3 << TC_CMR_LDRA_SHIFT)
#  define TC_CMR_LDRA_NONE           (0 << TC_CMR_LDRA_SHIFT) /* None */
#  define TC_CMR_LDRA_REDGE          (1 << TC_CMR_LDRA_SHIFT) /* Rising edge of TIOA */
#  define TC_CMR_LDRA_FEDGE          (2 << TC_CMR_LDRA_SHIFT) /* Falling edge of TIOA */
#  define TC_CMR_LDRA_EACH           (3 << TC_CMR_LDRA_SHIFT) /* Each  edge of TIOA */
#define TC_CMR_LDRB_SHIFT            (18)      /* Bits 18-19: RB Loading Selection */
#define TC_CMR_LDRB_MASK             (3 << TC_CMR_LDRB_SHIFT)
#  define TC_CMR_LDRB_NONE           (0 << TC_CMR_LDRB_SHIFT) /* None */
#  define TC_CMR_LDRB_REDGE          (1 << TC_CMR_LDRB_SHIFT) /* Rising edge of TIOB */
#  define TC_CMR_LDRB_FEDGE          (2 << TC_CMR_LDRB_SHIFT) /* Falling edge of TIOB */
#  define TC_CMR_LDRB_EACH           (3 << TC_CMR_LDRB_SHIFT) /* Each  edge of TIOB */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#define TC_CMR_SBSMPLR_SHIFT         (20)      /* Bits 20-22: Loading Edge Subsampling Ratio */
#define TC_CMR_SBSMPLR_MASK          (7 << TC_CMR_SBSMPLR_SHIFT)
#  define TC_CMR_SBSMPLR_ ONE        (0 << TC_CMR_SBSMPLR_SHIFT) /* Load on each selected edge */
#  define TC_CMR_SBSMPLR_ HALF       (1 << TC_CMR_SBSMPLR_SHIFT) /* Load on every 2 selected edges */
#  define TC_CMR_SBSMPLR_ 4TH        (2 << TC_CMR_SBSMPLR_SHIFT) /* Load on every 4 selected edges */
#  define TC_CMR_SBSMPLR_ 8TH        (3 << TC_CMR_SBSMPLR_SHIFT) /* Load on every 8 selected edges */
#  define TC_CMR_SBSMPLR_ 16TH       (4 << TC_CMR_SBSMPLR_SHIFT) /* Load on every 16 selected edges */
#endif

/* TC Channel Mode Register -- Waveform mode only */

#define TC_CMR_CPCSTOP               (1 << 6)  /* Bit 6: Counter Clock Stopped with RC Compare (Waveform mode) */
#define TC_CMR_CPCDIS                (1 << 7)  /* Bit 7: Counter Clock Disable with RC Compare (Waveform mode) */
#define TC_CMR_EEVTEDG_SHIFT         (8)       /* Bits 8-9: External Event Edge Selection (Waveform mode) */
#define TC_CMR_EEVTEDG_MASK          (3 << TC_CMR_EEVTEDG_SHIFT)
#  define TC_CMR_EEVTEDG_NONE        (0 << TC_CMR_EEVTEDG_SHIFT) /* None */
#  define TC_CMR_EEVTEDG_REDGE       (1 << TC_CMR_EEVTEDG_SHIFT) /* Rising edge */
#  define TC_CMR_EEVTEDG_FEDGE       (2 << TC_CMR_EEVTEDG_SHIFT) /* Falling edge */
#  define TC_CMR_EEVTEDG_EACH        (3 << TC_CMR_EEVTEDG_SHIFT) /* Each edge */
#define TC_CMR_EEVT_SHIFT            (10)      /* Bits 10-11: External Event Selection (Waveform mode) */
#define TC_CMR_EEVT_MASK             (3 << TC_CMR_EEVT_SHIFT)
#  define TC_CMR_EEVT_TIOB           (0 << TC_CMR_EEVT_SHIFT) /* TIOB input */
#  define TC_CMR_EEVT_XC0            (1 << TC_CMR_EEVT_SHIFT) /* XC0 output */
#  define TC_CMR_EEVT_XC1            (2 << TC_CMR_EEVT_SHIFT) /* XC1 output */
#  define TC_CMR_EEVT_XC2            (3 << TC_CMR_EEVT_SHIFT) /* XC2 output */
#define TC_CMR_ENETRG                (1 << 12) /* Bit 12: External Event Trigger Enable (Waveform mode) */
#define TC_CMR_WAVSEL_SHIFT          (13)      /* Bits 13-14: Waveform Selection (Waveform mode) */
#define TC_CMR_WAVSEL_MASK           (3 << TC_CMR_WAVSEL_SHIFT)
#  define TC_CMR_WAVSEL_UP           (0 << TC_CMR_WAVSEL_SHIFT) /* UP mode w/o auto trigger (Waveform mode) */
#  define TC_CMR_WAVSEL_UPDWN        (1 << TC_CMR_WAVSEL_SHIFT) /* UPDOWN mode w/o  auto trigger (Waveform mode) */
#  define TC_CMR_WAVSEL_UPAUTO       (2 << TC_CMR_WAVSEL_SHIFT) /* UP mode with auto trigger (Waveform mode) */
#  define TC_CMR_WAVSEL_UPDWNAUTO    (3 << TC_CMR_WAVSEL_SHIFT) /* UPDOWN mode with auto trigger (Waveform mode) */
#define TC_CMR_ACPA_SHIFT            (16)      /* Bits 16-17: RA Compare Effect on TIOA (Waveform mode) */
#define TC_CMR_ACPA_MASK             (3 << TC_CMR_ACPA_SHIFT)
#  define TC_CMR_ACPA_NONE           (0 << TC_CMR_ACPA_SHIFT)
#  define TC_CMR_ACPA_SET            (1 << TC_CMR_ACPA_SHIFT)
#  define TC_CMR_ACPA_CLEAR          (2 << TC_CMR_ACPA_SHIFT)
#  define TC_CMR_ACPA_TOGGLE         (3 << TC_CMR_ACPA_SHIFT)
#define TC_CMR_ACPC_SHIFT            (18)      /* Bits 18-19: RC Compare Effect on TIOA (Waveform mode) */
#define TC_CMR_ACPC_MASK             (3 << TC_CMR_ACPC_SHIFT)
#  define TC_CMR_ACPC_NONE           (0 << TC_CMR_ACPC_SHIFT)
#  define TC_CMR_ACPC_SET            (1 << TC_CMR_ACPC_SHIFT)
#  define TC_CMR_ACPC_CLEAR          (2 << TC_CMR_ACPC_SHIFT)
#  define TC_CMR_ACPC_TOGGLE         (3 << TC_CMR_ACPC_SHIFT)
#define TC_CMR_AEEVT_SHIFT           (20)      /* Bits 20-21: External Event Effect on TIOA (Waveform mode) */
#define TC_CMR_AEEVT_MASK            (3 << TC_CMR_AEEVT_SHIFT)
#  define TC_CMR_AEEVT_NONE          (0 << TC_CMR_AEEVT_SHIFT)
#  define TC_CMR_AEEVT_SET           (1 << TC_CMR_AEEVT_SHIFT)
#  define TC_CMR_AEEVT_CLEAR         (2 << TC_CMR_AEEVT_SHIFT)
#  define TC_CMR_AEEVT_TOGGLE        (3 << TC_CMR_AEEVT_SHIFT)
#define TC_CMR_ASWTRG_SHIFT          (22)      /* Bits 22-23: Software Trigger Effect on TIOA (Waveform mode) */
#define TC_CMR_ASWTRG_MASK           (3 << TC_CMR_ASWTRG_SHIFT)
#  define TC_CMR_ASWTRG_NONE         (0 << TC_CMR_ASWTRG_SHIFT)
#  define TC_CMR_ASWTRG_SET          (1 << TC_CMR_ASWTRG_SHIFT)
#  define TC_CMR_ASWTRG_CLEAR        (2 << TC_CMR_ASWTRG_SHIFT)
#  define TC_CMR_ASWTRG_TOGGLE       (3 << TC_CMR_ASWTRG_SHIFT)
#define TC_CMR_BCPB_SHIFT            (24)      /* Bits 24-25: RB Compare Effect on TIOB (Waveform mode) */
#define TC_CMR_BCPB_MASK             (3 << TC_CMR_BCPB_SHIFT)
#  define TC_CMR_BCPB_NONE           (0 << TC_CMR_BCPB_SHIFT)
#  define TC_CMR_BCPB_SET            (1 << TC_CMR_BCPB_SHIFT)
#  define TC_CMR_BCPB_CLEAR          (2 << TC_CMR_BCPB_SHIFT)
#  define TC_CMR_BCPB_TOGGLE         (3 << TC_CMR_BCPB_SHIFT)
#define TC_CMR_BCPC_SHIFT            (26)      /* Bits 26-27: RC Compare Effect on TIOB (Waveform mode) */
#define TC_CMR_BCPC_MASK             (3 << TC_CMR_BCPC_SHIFT)
#  define TC_CMR_BCPC_NONE           (0 << TC_CMR_BCPC_SHIFT)
#  define TC_CMR_BCPC_SET            (1 << TC_CMR_BCPC_SHIFT)
#  define TC_CMR_BCPC_CLEAR          (2 << TC_CMR_BCPC_SHIFT)
#  define TC_CMR_BCPC_TOGGLE         (3 << TC_CMR_BCPC_SHIFT)
#define TC_CMR_BEEVT_SHIFT           (28)      /* Bits 28-29: External Event Effect on TIOB (Waveform mode) */
#define TC_CMR_BEEVT_MASK            (3 << TC_CMR_BEEVT_SHIFT)
#  define TC_CMR_BEEVT_NONE          (0 << TC_CMR_BEEVT_SHIFT)
#  define TC_CMR_BEEVT_SET           (1 << TC_CMR_BEEVT_SHIFT)
#  define TC_CMR_BEEVT_CLEAR         (2 << TC_CMR_BEEVT_SHIFT)
#  define TC_CMR_BEEVT_TOGGLE        (3 << TC_CMR_BEEVT_SHIFT)
#define TC_CMR_BSWTRG_SHIFT          (30)      /* Bits 30-31: Software Trigger Effect on TIOB (Waveform mode) */
#define TC_CMR_BSWTRG_MASK           (3 << TC_CMR_BSWTRG_SHIFT)
#  define TC_CMR_BSWTRG_NONE         (0 << TC_CMR_BSWTRG_SHIFT)
#  define TC_CMR_BSWTRG_SET          (1 << TC_CMR_BSWTRG_SHIFT)
#  define TC_CMR_BSWTRG_CLEAR        (2 << TC_CMR_BSWTRG_SHIFT)
#  define TC_CMR_BSWTRG_TOGGLE       (3 << TC_CMR_BSWTRG_SHIFT)

/* Stepper Motor Mode Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_SMMR_GCEN               (1 << 0)  /* Bit 0:  Gray Count Enable */
#  define TC_SMMR_DOWN               (1 << 1)  /* Bit 1:  DOWN Count */
#endif

/* Register AB -- 32-bit value */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_RAB_MASK                (0xffffffff)
#endif

