apache/nuttx/arch/arm/src/sam34/chip/sam_tc.h
/* TC Counter Value Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_CV_MASK                 (0xffffffff)
#else
#  define TC_CV_MASK                 (0x0000ffff)
#endif

/* TC Register A, B, C */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_RVALUE_MASK             (0xffffffff)
#else
#  define TC_RVALUE_MASK             (0x0000ffff)
#endif

/* TC Status Register, TC Interrupt Enable Register, TC Interrupt Disable Register, and  TC Interrupt Mask Register common bit-field definitions */

#define TC_INT_COVFS                 (1 << 0)  /* Bit 0:  Counter Overflow */
#define TC_INT_LOVRS                 (1 << 1)  /* Bit 1:  Load Overrun */
#define TC_INT_CPAS                  (1 << 2)  /* Bit 2:  RA Compare */
#define TC_INT_CPBS                  (1 << 3)  /* Bit 3:  RB Compare */
#define TC_INT_CPCS                  (1 << 4)  /* Bit 4:  RC Compare */
#define TC_INT_LDRAS                 (1 << 5)  /* Bit 5:  RA Loading */
#define TC_INT_LDRBS                 (1 << 6)  /* Bit 6:  RB Loading */
#define TC_INT_ETRGS                 (1 << 7)  /* Bit 7:  External Trigger */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_INT_ENDRX               (1 << 8)  /* Bit 8: End of Receiver Transfer */
#  define TC_INT_RXBUFF              (1 << 9)  /* Bit 9: Reception Buffer Full */
#  define TC_INT_ALL                 (TC_INT_COVFS + TC_INT_LOVRS + TC_INT_CPAS + TC_INT_CPBS + TC_INT_CPCS + TC_INT_LDRAS + TC_INT_LDRBS + TC_INT_ETRGS + TC_INT_ENDRX + TC_INT_RXBUFF)
#else
#  define TC_INT_ALL                 (TC_INT_COVFS + TC_INT_LOVRS + TC_INT_CPAS + TC_INT_CPBS + TC_INT_CPCS + TC_INT_LDRAS + TC_INT_LDRBS + TC_INT_ETRGS)
#endif

#define TC_INT_CLKSTA                (1 << 16) /* Bit 16: Clock Enabling (SR only) */
#define TC_SR_MTIOA                  (1 << 17) /* Bit 17: TIOA Mirror (SR only) */
#define TC_SR_MTIOB                  (1 << 18) /* Bit 18: TIOB Mirror (SR only)*/

/* Extended Mode Register */

#if defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_EMR_TRIGSRCA_SHIFT      (0)       /* Bits 0-1: Trigger source for input A */
#  define TC_EMR_TRIGSRCA_MASK       (3 << TC_EMR_TRIGSRCA_SHIFT)
#    define TC_EMR_TRIGSRCA_TIOA     (0 << TC_EMR_TRIGSRCA_SHIFT) /* Input A driven by pin TIOAx */
#    define TC_EMR_TRIGSRCA_PWM      (1 << TC_EMR_TRIGSRCA_SHIFT) /* Input A driven by PWMx */
#  define TC_EMR_TRIGSRCB_SHIFT      (5)       /* Bits 4-5: Trigger source for input B */
#  define TC_EMR_TRIGSRCB_MASK       (3 << TC_EMR_TRIGSRCB_SHIFT)
#    define TC_EMR_TRIGSRCB_TIOA     (0 << TC_EMR_TRIGSRCB_SHIFT) /* Input B driven by pin TIOBx */
#    define TC_EMR_TRIGSRCB_PWM      (1 << TC_EMR_TRIGSRCB_SHIFT) /* Input B driven by PWMx */
#  define TC_EMR_NODIVCLK            (1 << 8)  /* Bit 8:  NO DIVided CLocK */
#endif

/* Timer common registers ***********************************************************************/
/* TC Block Control Register */

#define TC_BCR_SYNC                  (1 << 0)  /* Bit 0: Synchro Command */

/* TC Block Mode Register */

#define TC_BMR_TC0XC0S_SHIFT         (0)       /* Bits 0-1: External Clock Signal 0 Selection */
#define TC_BMR_TC0XC0S_MASK          (3 << TC_BMR_TC0XC0S_SHIFT)
#  define TC_BMR_TC0XC0S_TCLK0       (0 << TC_BMR_TC0XC0S_SHIFT)
#  define TC_BMR_TC0XC0S_NONE        (1 << TC_BMR_TC0XC0S_SHIFT)
#  define TC_BMR_TC0XC0S_TIOA1       (2 << TC_BMR_TC0XC0S_SHIFT)
#  define TC_BMR_TC0XC0S_TIOA2       (3 << TC_BMR_TC0XC0S_SHIFT)
#define TC_BMR_TC1XC1S_SHIFT         (2)       /* Bits 2-3: External Clock Signal 1 Selection */
#define TC_BMR_TC1XC1S_MASK          (3 << TC_BMR_TC1XC1S_MASK)
#  define TC_BMR_TC1XC1S_TCLK1       (0 << TC_BMR_TC1XC1S_SHIFT)
#  define TC_BMR_TC1XC1S_NONE        (1 << TC_BMR_TC1XC1S_SHIFT)
#  define TC_BMR_TC1XC1S_TIOA0       (2 << TC_BMR_TC1XC1S_SHIFT)
#  define TC_BMR_TC1XC1S_TIOA2       (3 << TC_BMR_TC1XC1S_SHIFT)
#define TC_BMR_TC2XC2S_SHIFT         (4)       /* Bits 4-5: External Clock Signal 2 Selection */
#define TC_BMR_TC2XC2S_MASK          (3 << TC_BMR_TC2XC2S_SHIFT)
#if defined(CONFIG_ARCH_CHIP_SAM4s) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_BMR_TC2XC2S_TCLK2       (0 << TC_BMR_TC2XC2S_SHIFT)
#  define TC_BMR_TC2XC2S_TIOA1       (2 << TC_BMR_TC2XC2S_SHIFT)
#  define TC_BMR_TC2XC2S_TIOA2       (3 << TC_BMR_TC2XC2S_SHIFT)
#else
#  define TC_BMR_TC2XC2S_TCLK2       (0 << TC_BMR_TC2XC2S_SHIFT)
#  define TC_BMR_TC2XC2S_NONE        (1 << TC_BMR_TC2XC2S_SHIFT)
#  define TC_BMR_TC2XC2S_TIOA0       (2 << TC_BMR_TC2XC2S_SHIFT)
#  define TC_BMR_TC2XC2S_TIOA1       (3 << TC_BMR_TC2XC2S_SHIFT)
#endif
#define TC_BMR_QDEN                  (1 << 8)  /* Bit 8:  Quadrature Decoder Enabled */
#define TC_BMR_POSEN                 (1 << 9)  /* Bit 9:  Position Enabled */
#define TC_BMR_SPEEDEN               (1 << 10) /* Bit 10: Speed Enabled */
#define TC_BMR_QDTRANS               (1 << 11) /* Bit 11: Quadrature Decoding Transparent */
#define TC_BMR_EDGPHA                (1 << 12) /* Bit 12: Edge on PHA count mode */
#define TC_BMR_INVA                  (1 << 13) /* Bit 13: Inverted PHA */
#define TC_BMR_INVB                  (1 << 14) /* Bit 14: Inverted PHB */
#define TC_BMR_INVIDX                (1 << 15) /* Bit 15: Inverted Index */
#define TC_BMR_SWAP                  (1 << 16) /* Bit 16: Swap PHA and PHB */
#define TC_BMR_IDXPHB                (1 << 17) /* Bit 17: Index pin is PHB pin */
#define TC_BMR_FILTER                (1 << 19) /* Bit 19 */
#define TC_BMR_MAXFILT_SHIFT         (20)      /* Bits 20-25: Maximum Filter */
#define TC_BMR_MAXFILT_MASK          (63 << TC_BMR_MAXFILT_SHIFT)
#  define TC_BMR_MAXFILT(n)          ((uint32_t)(n) << TC_BMR_MAXFILT_SHIFT)

/* TC QDEC Interrupt Enable Register, TC QDEC Interrupt Disable Register,
 * TC QDEC Interrupt Mask Register, TC QDEC Interrupt Status Register common
 * bit field definitions
 */

#define TC_QINT_IDX                  (1 << 0)  /* Bit 0: Index (Common) */
#define TC_QINT_DIRCHG               (1 << 1)  /* Bit 1: Direction Change (Common) */
#define TC_QINT_QERR                 (1 << 2)  /* Bit 2: Quadrature Error (Common) */
#define TC_QISR_DIR                  (1 << 8)  /* Bit 8: Direction (QISR only) */

/* Fault Mode Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_FMR_ENCF0               (1 << 0)  /* Bit 0:  Enable compare fault channel 0 */
#  define TC_FMR_ENCF1               (1 << 1)  /* Bit 1:  Enable compare fault channel 1 */
#endif

/* Write Protect Mode Register */

#if defined(CONFIG_ARCH_CHIP_SAM4S) || defined(CONFIG_ARCH_CHIP_SAM4E)
#  define TC_WPMR_WPEN               (1 << 0)  /* Bit 0:  Write Protect Enable */
#  define TC_WPMR_WPKEY_SHIFT        (8)       /* Bits 8-31: Write Protect KEY */
#  define TC_WPMR_WPKEY_MASK         (0x00ffffff << TC_WPMR_WPKEY_SHIFT)
#    define TC_WPMR_WPKEY            (0x0054494d << TC_WPMR_WPKEY_SHIFT)
#endif

/************************************************************************************************
 * Public Types
 ************************************************************************************************/

/************************************************************************************************
 * Public Data
 ************************************************************************************************/

/************************************************************************************************
 * Public Functions
 ************************************************************************************************/

#endif /* __ARCH_ARM_SRC_SAM34_CHIP_SAM_TC_H */
